import streamlit as st


st.markdown("# Main page 🎈")


st.write("## 国内新闻")

st.write("### 三个III期临床连连受挫，这家biotech要绝地求生")
st.write("开拓药业近期面临三个III期临床试验失败的挫折，导致投资者关注度降低。公司进行了大规模裁员，涉及各个部门。重要药物福瑞他恩（KX-826）在中国的III期临床试验失败后，许多员工已离职。公司决定继续进行KX-826的临床试验，将剂量提升至1%并重新试验。公司计划继续推进AR拮抗剂和相关衍生药物的研发，包括针对前列腺癌、新冠和脱发的治疗。公司已提交KX-826和GT20029的临床试验申请，并计划在2023年公布针对雄秃的II期临床试验结果。公司面临资金压力，但财务负责人表示现金和贷款可以支持临床试验。公司创始人增持公司股份，表达对产品管线的信心。开拓药业承认临床试验质量监控不佳可能是KX-826临床试验失败的原因之一。开拓药业还介绍了GT20029的研发进展，该药具有潜在的市场价值。")
st.write("信息来源：36kr")

st.write("### 股票研报未遵守披露规定 港证监谴责瑞信罚款280万港元")
st.write("香港证监会对瑞信进行了公开谴责，并罚款280万港元，原因是瑞信在发表有关香港上市证券的研究报告时未遵守披露规定。根据相关规定，任何在香港从事投资银行、自营交易或庄家活动的证券中介机构，如果与证券发行人或新上市申请人存在业务关系，应在研究报告中进行披露。香港证监会强调，持牌证券中介机构应遵守披露规定，并及时发现披露缺失。")
st.write("信息来源：财新网")

st.write("### 供销社概念股逆势大涨 天鹅股份封涨停")
st.write("1月4日，天鹅股份逆势封涨停，中再资环涨幅超过5%，ST大集涨停，中农联合、湖南发展、中农立华等股票也跟涨。根据消息，ST大集昨晚公告称实控人将变更为中华全国供销合作总社。")
st.write("信息来源：财联社")


st.write("## 国外新闻")
st.write("### 韩国一人户家庭占比首次超过40% 人口老龄化加剧")
st.write("根据官方数据显示，韩国一人户家庭在家庭总户数中的比例首次超过40%。这一增长主要是由于未婚单身人员和独居老人的增加。截至去年12月，韩国登记在册的家庭户数为2391.4851万户，其中一人户家庭占比达到42%，为993.56万户，同比增加21.1344万户。同时，二人户和三人户家庭的数量有所增加，而四人户和五人户家庭的数量有所减少。这一数据反映了韩国家庭结构的变化趋势。")
st.write("信息来源：新浪")

st.write("### 马斯克的X平台推出面向小企业的订阅服务，每月收费200美元")
st.write("斯克的社交媒体平台X推出了面向小企业的订阅服务，每月收费200美元。新的订阅服务提供金色认证标记、广告积分和Premium+订阅等功能。此前，X曾收取每月1000美元的订阅费用，但因为企业认为认证并没有带来足够的价值，所以收费过高。现在，X推出了更为实惠的订阅选项，希望能吸引更多小企业的参与。")
st.write("信息来源：新浪")

st.write("### 英国医生将举行罢工行动，抗议政府医疗改革")
st.write("英国医生举行罢工，抗议英格兰国家医疗服务体系（NHS）的工作条件和薪资待遇。罢工由英国医学协会（BMA）组织，初级医生要求改善工作环境和薪资增加。BMA要求薪资增加35％，但表示并不一定需要一次性给出全部。政府表示，在罢工仍在进行中时，不准备进行谈判。罢工导致医院服务受到严重干扰，包括手术和检查的延迟。一些医院宣布危急事件，急诊室等待时间较长。英国国家医疗服务体系（NHS）警告称，这次罢工可能是最困难的一次，因为冬季疫情和员工病假增加使得医院面临巨大挑战。")
st.write("信息来源：BBC")
